<!DOCTYPE html>
<html lang="es" data-base-path="../">
<head>
  <meta charset="UTF-8" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
  <meta name="description" content="La blockchain explicada: cadena de bloques enlazados criptogr&#225;ficamente. Inmutabilidad, transparencia y el bloque g&#233;nesis de Bitcoin." />
  <title>&#191;Qu&#233; es la blockchain? &#8212; Base de Conocimiento | aprendebtc.com</title>
  <link rel="preconnect" href="https://fonts.googleapis.com" />
  <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin />
  <link rel="stylesheet" href="../css/main.css" />
  <link rel="stylesheet" href="../css/components.css" />
</head>
<body>
  <div data-include="header"></div>

  <div class="page-layout">
    <aside class="page-layout__sidebar" aria-label="Navegacion de la base">
      <nav class="sidebar">
        <div class="sidebar__ad-wrap">
          <div class="ad-slot ad-sidebar" id="ad-sidebar-auto" aria-hidden="true"></div>
        </div>
      </nav>
    </aside>

    <main class="page-layout__content" id="main-content">
      <div class="content-inner">
        <nav class="breadcrumb" aria-label="Ruta de navegacion">
          <a href="/" class="breadcrumb__item">Inicio</a><span class="breadcrumb__separator" aria-hidden="true">&rsaquo;</span><a href="/base/" class="breadcrumb__item">Base de Conocimiento</a><span class="breadcrumb__separator" aria-hidden="true">&rsaquo;</span><span class="breadcrumb__current">&#191;Qu&#233; es la blockchain?</span>
        </nav>

        <article class="article">
          <div class="nivel-badge nivel-badge--base article__badge">Base</div>
          <h1>&#191;Qu&#233; es la blockchain?</h1>
          <p class="article__subtitle">Una cadena de bloques enlazados criptogr&#225;ficamente. Cada bloque apunta al anterior. Imposible modificar sin detectar.</p>

<h2>Definici&#243;n</h2>

<p>La blockchain (cadena de bloques) es una estructura de datos que almacena todas las transacciones de Bitcoin en orden cronol&#243;gico. Cada bloque contiene un grupo de transacciones y un enlace criptogr&#225;fico al bloque anterior.</p>

<p>Este enlace (un hash del bloque previo) es lo que forma la &quot;cadena&quot;. Modificar cualquier bloque antiguo cambiar&#237;a su hash, rompiendo el enlace con el siguiente, y as&#237; sucesivamente.</p>

<h2>Estructura de un bloque</h2>

<p>Cada bloque contiene:</p>

<p><strong>Header (cabecera):</strong> Metadatos del bloque incluyendo:</p>

<ul>

<li>Referencia al bloque anterior (hash)</li>

<li>Resumen de las transacciones (Merkle root)</li>

<li>Timestamp</li>

<li>Datos de miner&#237;a (dificultad, nonce)</li>

</ul>

<p><strong>Transacciones:</strong> La lista de transacciones incluidas en este bloque, empezando por la &quot;coinbase&quot; que crea los bitcoin nuevos.</p>

<p>Un bloque nuevo se a&#241;ade aproximadamente cada 10 minutos.</p>

<h2>Inmutabilidad</h2>

<p>La blockchain de Bitcoin es pr&#225;cticamente inmutable. Para modificar una transacci&#243;n antigua:</p>

<ol>

<li>1. Habr&#237;a que recalcular el bloque que la contiene</li>

<li>2. Y todos los bloques posteriores</li>

<li>3. M&#225;s r&#225;pido de lo que el resto de la red a&#241;ade bloques nuevos</li>

</ol>

<p>Esto requerir&#237;a m&#225;s poder computacional que toda la red Bitcoin combinada, mantenido durante un tiempo prolongado. El coste ser&#237;a astron&#243;mico y el beneficio limitado.</p>

<p>Por eso las transacciones con muchas confirmaciones se consideran irreversibles: cada bloque a&#241;adido aumenta exponencialmente la dificultad de alteraci&#243;n.</p>

<h2>Transparencia</h2>

<p>La blockchain es completamente p&#250;blica. Cualquiera puede:</p>

<ul>

<li>Descargar toda la blockchain</li>

<li>Verificar cualquier transacci&#243;n</li>

<li>Ver el historial completo desde 2009</li>

<li>Auditar la oferta total de bitcoin</li>

</ul>

<p>No hay datos ocultos. No hay transacciones secretas. Todo es verificable.</p>

<p>Esta transparencia es lo que permite que el sistema funcione sin confianza: no necesitas confiar en que alguien lleva bien las cuentas porque puedes verificarlo t&#250; mismo.</p>

<h2>Tama&#241;o y crecimiento</h2>

<p>La blockchain de Bitcoin ocupa actualmente unos 600 GB y crece aproximadamente 50-60 GB por a&#241;o.</p>

<p>Cualquiera puede descargarla ejecutando un nodo Bitcoin. La primera sincronizaci&#243;n tarda d&#237;as (hay que verificar todo el historial), pero despu&#233;s solo se descargan bloques nuevos.</p>

<h2>El bloque g&#233;nesis</h2>

<p>El primer bloque de Bitcoin (bloque 0 o &quot;g&#233;nesis&quot;) fue creado por Satoshi Nakamoto el 3 de enero de 2009.</p>

<p>Contiene un mensaje en los datos de la coinbase: &quot;The Times 03/Jan/2009 Chancellor on brink of second bailout for banks&quot;</p>

<p>Este titular del peri&#243;dico The Times de ese d&#237;a sirve como prueba de que el bloque no pudo crearse antes de esa fecha, y como comentario sobre el sistema financiero que Bitcoin pretend&#237;a ofrecer como alternativa.</p>

<p>Curiosamente, los 50 BTC de recompensa del bloque g&#233;nesis no son gastables debido a una peculiaridad del c&#243;digo original.</p>

<h2>Blockchain vs &quot;la tecnolog&#237;a blockchain&quot;</h2>

<p>El t&#233;rmino &quot;blockchain&quot; se ha usado para describir tecnolog&#237;as muy diferentes a Bitcoin: bases de datos empresariales, sistemas de votaci&#243;n, &quot;blockchains privadas&quot;, etc.</p>

<p>La blockchain de Bitcoin tiene propiedades espec&#237;ficas (descentralizaci&#243;n real, proof of work, resistencia a censura) que la mayor&#237;a de estas otras &quot;blockchains&quot; no comparten.</p>

<p>En aprendeBTC, cuando hablamos de blockchain nos referimos espec&#237;ficamente a la de Bitcoin.</p>

<p>&gt; ENLACE BASE: Qu&#233; es la miner&#237;a &#8594; <a href="/base/que-es-la-mineria.html">/base/que-es-la-mineria.html</a></p>

<p>&gt; ENLACE BASE: Qu&#233; es una confirmaci&#243;n &#8594; <a href="/base/que-es-una-confirmacion.html">/base/que-es-una-confirmacion.html</a></p>

          <div class="ad-slot ad-content" id="ad-content-auto" aria-hidden="true"></div>

          <nav class="page-nav" aria-label="Navegacion entre paginas">
            <a href="/base/como-funciona-bitcoin.html" class="page-nav__item">
              <span class="page-nav__label">&larr; Anterior</span>
              <span class="page-nav__title">&#191;C&#243;mo funciona Bitcoin?</span>
            </a>
            <a href="/base/que-es-la-mineria.html" class="page-nav__item page-nav__item--next">
              <span class="page-nav__label">Siguiente &rarr;</span>
              <span class="page-nav__title">&#191;Qu&#233; es la miner&#237;a?</span>
            </a>
          </nav>
        </article>
      </div>
    </main>
  </div>

  <div data-include="footer"></div>
  <script src="../js/includes.js"></script>
  <script src="../js/nav.js"></script>
  <script src="../js/search.js"></script>
</body>
</html>
